-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 2017-05-29 06:55:33
-- 服务器版本： 10.1.21-MariaDB
-- PHP Version: 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `library`
--

-- --------------------------------------------------------

--
-- 表的结构 `books`
--

CREATE TABLE `books` (
  `bookid` int(11) NOT NULL,
  `booktype` varchar(225) NOT NULL,
  `bookimg` varchar(225) NOT NULL,
  `booknum` int(11) NOT NULL,
  `bookname` varchar(225) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `books`
--

INSERT INTO `books` (`bookid`, `booktype`, `bookimg`, `booknum`, `bookname`) VALUES
(2, '教材教辅', 'images/02.jpg', 5, '幼儿园面试一本通'),
(3, '教材教辅', 'images/04.jpg', 54, '全新法语语法'),
(4, '教材教辅', 'images/05.jpg', 16, '中医基础理论'),
(5, '教材教辅', 'images/2.jpg', 88, '营销管理'),
(6, '教材教辅', 'images/8.jpg', 45, '内科学'),
(7, '教材教辅', 'images/4.jpg', 66, '当代教育心理学'),
(8, '语言文学', 'images/06.jpg', 74, '这么慢那么美'),
(9, '热门书籍', 'images/09.jpg', 13, '与你重逢'),
(10, '教材教辅', 'images/5.jpg', 41, '中国教育史'),
(11, '教材教辅', 'images/7.jpg', 25, '概率论与数理统计'),
(12, '教材教辅', 'images/9.jpg', 54, '国家临床执业及助理医师资格考试'),
(14, '计算机', 'images/07.jpg', 56, '数据库系统概念'),
(15, '计算机', 'images/08.jpg', 46, 'C程序设计'),
(16, '语言文学', 'images/10.jpg', 48, '孤独小说家'),
(17, '热门书籍', 'images/11.jpg', 25, '天上再见'),
(18, '语言文学', 'images/12.jpg', 105, '守夜者'),
(19, '语言文学', 'images/13.jpg', 124, '假如岁月足够长'),
(20, '语言文学', 'images/15.jpg', 24, '晚风如诉'),
(22, '热门书籍', 'images/14.jpg', 45, '人民的名义'),
(23, '热门书籍', 'images/17.jpg', 4, '杀死一只知更鸟'),
(24, '语言文学', 'images/18.jpg', 19, '雪国'),
(25, '热门书籍', 'images/19.jpg', 5, '教父'),
(26, '热门书籍', 'images/20.jpg', 9, '欢乐颂'),
(27, '语言文学', 'images/20.jpg', 9, '欢乐颂'),
(28, '语言文学', 'images/21.jpg', 56, '西游记'),
(29, '语言文学', 'images/22.jpg', 74, '人生'),
(30, '语言文学', 'images/24.jpg', 64, '冰与火之歌'),
(31, '热门书籍', 'images/25.jpg', 8, '霸王别姬'),
(32, '语言文学', 'images/25.jpg', 8, '霸王别姬'),
(33, '语言文学', 'images/26.jpg', 46, '骆驼祥子'),
(34, '教材教辅', 'images/28.jpg', 109, 'Refets走遍法国'),
(35, '教材教辅', 'images/29.jpg', 201, '大学法语考研必备'),
(36, '教材教辅', 'images/30.jpg', 104, '法语交际口语渐进'),
(37, '计算机', 'images/31.jpg', 54, 'Web前端开发'),
(38, '计算机', 'images/32.jpg', 34, 'Web前端黑客技术揭秘'),
(39, '计算机', 'images/33.jpg', 28, 'JavaScript高级程序设计'),
(40, '计算机', 'images/34.jpg', 24, '单页web应用JavaScript从前端到后端'),
(41, '计算机', 'images/35.jpg', 41, 'web前端开发技术'),
(42, '计算机', 'images/36.jpg', 51, '码农'),
(43, '热门书籍', 'images/36.jpg', 51, '码农'),
(44, '计算机', 'images/37.jpg', 21, '网络是怎样连接的'),
(45, '计算机', 'images/38.jpg', 11, '计算机程序的构造和解析'),
(46, '计算机', 'images/39.jpg', 44, '图解HTTP'),
(47, '计算机', 'images/40.jpg', 22, '编译原理'),
(48, '计算机', 'images/41.jpg', 33, '算法'),
(49, '计算机', 'images/42.jpg', 55, '程序是怎样跑起来的'),
(50, '计算机', 'images/43.jpg', 66, '黑客攻防从入门到精通'),
(51, '计算机', 'images/44.jpg', 13, 'C程序设计语言'),
(52, '计算机', 'images/45.jpg', 34, 'R语言编程艺术'),
(53, '计算机', 'images/46.jpg', 15, 'JavaScript DOM编程艺术'),
(54, '计算机', 'images/47.jpg', 18, 'Java编程思想'),
(55, '计算机', 'images/48.jpg', 46, 'Go语言学习笔记'),
(56, '语言文学', 'images/50.jpg', 37, '哈利波特1'),
(57, '计算机', 'images/51.jpg', 27, 'IOS软件开发兵法'),
(58, '热门书籍', 'images/51.jpg', 27, 'IOS软件开发兵法'),
(59, '语言文学', 'images/52.jpg', 39, ''),
(60, '语言文学', 'images/53.jpg', 67, '半小时漫画中国史'),
(61, '教材教辅', 'images/54.jpg', 47, '美国宪法的经济解析'),
(62, '语言文学', 'images/55.jpg', 33, '浮生六记'),
(66, '教材教辅', 'images/03.jpg', 44, '张宇高等数学18讲'),
(67, '热门书籍', 'images/04.jpg', 34, '全新法语语法'),
(68, '哲学理论', 'images/56.jpg', 44, '相对论'),
(69, '哲学理论', 'images/57.jpg', 29, '沉思录'),
(70, '哲学理论', 'images/58.jpg', 71, '源泉'),
(72, '哲学理论', 'images/59.jpg', 71, '叔本华：意志和表象的世界'),
(73, '哲学理论', 'images/60.jpg', 19, '正义的可能'),
(74, '哲学理论', 'images/61.jpg', 24, '论人类不平等的起源和基础'),
(75, '哲学理论', 'images/62.jpg', 31, '作为意志和表象的世界'),
(76, '哲学理论', 'images/63.jpg', 25, '历史主义贫困论'),
(77, '哲学理论', 'images/64.jpg', 17, '东西文化及其哲学'),
(78, '哲学理论', 'images/65.jpg', 28, '维特根斯坦语言哲学评析'),
(79, '哲学理论', 'images/66.jpg', 41, '中西古代历史，史学与理论比较研究'),
(80, '哲学理论', 'images/67.jpg', 17, '马克思主义历史观研究'),
(81, '哲学理论', 'images/68.jpg', 18, '悲剧的诞生'),
(82, '哲学理论', 'images/69.jpg', 24, '论历史'),
(83, '哲学理论', 'images/70.jpg', 47, '马克思主义辩证法研究'),
(84, '哲学理论', 'images/71.jpg', 35, '沉思录2'),
(85, '哲学理论', 'images/72.jpg', 33, '哲学作为严格的科学'),
(86, '哲学理论', 'images/73.jpg', 22, '正义的理念'),
(87, '哲学理论', 'images/74.jpg', 11, '马克思主义价值理论研究'),
(88, '哲学理论', 'images/75.jpg', 14, '偶在论谱系'),
(89, '哲学理论', 'images/76.jpg', 22, '汤因比论汤因比'),
(93, '哲学理论', 'images/78.jpg', 17, '真理与批判'),
(94, '哲学理论', 'images/79.jpg', 21, '宗教与哲学'),
(95, '哲学理论', 'images/80.jpg', 31, '内时间意识现象学'),
(96, '哲学理论', 'images/81.jpg', 26, '化学哲学新体系'),
(97, '教材教辅', 'images/82.jpg', 27, '实用机电英语'),
(98, '教材教辅', 'images/83.jpg', 28, '朱玉贤《现代分子生物学》'),
(99, '热门书籍', 'images/84.jpg', 10, '推销与谈判技巧'),
(100, '教材教辅', 'images/85.jpg', 31, '外贸会计实务'),
(101, '教材教辅', 'images/86.jpg', 32, '导游实务案例与分析'),
(102, '教材教辅', 'images/87.jpg', 34, '物流英语'),
(103, '教材教辅', 'images/88.jpg', 37, '项目管理实务'),
(104, '教材教辅', 'images/89.jpg', 26, '商业银行会计'),
(105, '教材教辅', 'images/90.jpg', 19, '电子商务基础'),
(106, '语言文学', 'images/91.jpg', 17, '香蕉的低语'),
(107, '语言文学', 'images/92.jpg', 44, '最好的我'),
(108, '语言文学', 'images/93.jpg', 19, '傲慢与偏见'),
(109, '语言文学', 'images/94.jpg', 22, '饥饿的女儿'),
(110, '语言文学', 'images/95.jpg', 18, '心灵之约'),
(111, '语言文学', 'images/96.jpg', 34, '黑郁金香'),
(112, '语言文学', 'images/97.jpg', 31, '生存游戏'),
(113, '语言文学', 'images/98.jpg', 21, '长眠不醒'),
(114, '语言文学', 'images/99.jpg', 47, '夜色温柔'),
(115, '语言文学', 'images/100.jpg', 19, '茶花女'),
(116, '语言文学', 'images/101.jpg', 27, '秘密花园'),
(117, '语言文学', 'images/102.jpg', 37, '战地钟声'),
(118, '语言文学', 'images/103.jpg', 28, '天空的另一半'),
(119, '热门书籍', 'images/104.jpg', 47, '人性的弱点'),
(120, '热门书籍', 'images/105.jpg', 44, '小王子'),
(121, '语言文学', 'images/106.jpg', 17, '安徒生童话'),
(122, '热门书籍', 'images/107.jpg', 11, '老人与海'),
(123, '热门书籍', 'images/108.jpg', 16, '泰戈尔诗选'),
(124, '教材教辅', 'images/109.jpg', 47, '计算机英语'),
(125, '计算机', 'images/110.jpg', 46, '深入理解计算机网络'),
(126, '计算机', 'images/111.jpg', 38, '架构师'),
(127, '计算机', 'images/112.jpg', 49, '网络技术基础与Internet英语'),
(128, '计算机', 'images/113.jpg', 43, '全国计算机等级考试教材'),
(129, '计算机', 'images/114.jpg', 54, '计算机的本质（深入剖析程序和计算机）'),
(130, '计算机', 'images/115.jpg', 48, '计算机组成原理'),
(131, '计算机', 'images/116.jpg', 43, '大学计算机基础'),
(132, '计算机', 'images/117.jpg', 37, 'HTTP权威指南'),
(133, '计算机', 'images/118.jpg', 34, '黑客与画家'),
(134, '计算机', 'images/119.jpg', 68, 'Python计算机视觉'),
(135, '计算机', 'images/120.jpg', 74, '计算机网络教程'),
(136, '计算机', 'images/121.jpg', 71, '编程珠玑'),
(137, '计算机', 'images/122.jpg', 73, '计算机专业英语'),
(138, '计算机', 'images/123.jpg', 67, 'TCP/IP入门经典'),
(139, '计算机', 'images/124.jpg', 42, 'Spark快速大数据分析'),
(140, '教材教辅', 'images/125.jpg', 38, 'SPSS统计分析从入门到精通'),
(141, '教材教辅', 'images/126.jpg', 45, '你不知道的JavaScript'),
(142, '教材教辅', 'images/127.jpg', 39, '五步学会ActoCAD'),
(143, '计算机', 'images/128.jpg', 64, 'TCP/IP最佳入门'),
(144, '计算机', 'images/129.jpg', 32, '计算机组成原理教程'),
(145, '计算机', 'images/130.jpg', 29, '数据库原理及应用教程'),
(146, '热门书籍', 'images/131.jpg', 29, '金字塔'),
(147, '热门书籍', 'images/132.jpg', 29, '不急，慢慢地'),
(148, '热门书籍', 'images/133.jpg', 19, '十二年前，我二十'),
(149, '热门书籍', 'images/134.jpg', 19, '101个有科学根据的减肥小偏方'),
(150, '热门书籍', 'images/135.jpg', 15, '月族'),
(151, '热门书籍', 'images/136.jpg', 8, '一个瑜伽行者的自传'),
(152, '热门书籍', 'images/137.jpg', 12, '回归生命的本源'),
(153, '语言文学', 'images/138.jpg', 39, '小镇边缘的黑暗'),
(154, '哲学理论', 'images/139.jpg', 45, '老子'),
(155, '哲学理论', 'images/140.jpg', 35, '中国哲学简史'),
(156, '哲学理论', 'images/141.jpg', 35, '西方哲学简史'),
(157, '哲学理论', 'images/142.jpg', 42, '寂静之道'),
(158, '哲学理论', 'images/143.jpg', 27, '哲学的慰藉'),
(159, '哲学理论', 'images/144.jpg', 26, '叔本华论道德与自由'),
(160, '哲学理论', 'images/145.jpg', 31, '人生的智慧'),
(161, '哲学理论', 'images/146.jpg', 17, '万达哲学'),
(162, '哲学理论', 'images/147.jpg', 24, '尼采的人生哲学'),
(163, '哲学理论', 'images/148.jpg', 27, '中国哲学简史（冯友兰著）'),
(164, '热门书籍', 'images/149.jpg', 42, '一生的忠告'),
(165, '热门书籍', 'images/150.jpg', 13, '人类简史'),
(166, '哲学理论', 'images/151.jpg', 44, '中国哲学十讲'),
(167, '哲学理论', 'images/152.jpg', 37, '哲学原来这么有趣'),
(168, '哲学理论', 'images/153.jpg', 39, '周易'),
(169, '哲学理论', 'images/154.jpg', 17, '中国哲学小史'),
(170, '哲学理论', 'images/155.jpg', 34, '马云：我的人生哲学'),
(171, '哲学理论', 'images/156.jpg', 28, '透过佛法看世界'),
(172, '哲学理论', 'images/157.jpg', 28, '第一哲学沉思集'),
(173, '哲学理论', 'images/158.jpg', 18, '自然哲学之数学原理'),
(175, '哲学理论', 'images/159.jpg', 44, '知行合一 王阳明'),
(176, '哲学理论', 'images/161.jpg', 31, '自然与快乐'),
(177, '哲学理论', 'images/162.jpg', 78, '生命对你意味着什么'),
(178, '计算机', 'images/163.jpg', 78, '高效程序员的45个习惯敏捷开发修炼之道'),
(179, '计算机', 'images/164.jpg', 52, '程序员面试金典'),
(180, '计算机', 'images/165.jpg', 57, '编写高质量代码前端开发修炼之道'),
(181, '计算机', 'images/166.jpg', 43, '锋利的Jquery'),
(182, '计算机', 'images/167.jpg', 50, '高性能响应式web开发实战'),
(183, '计算机', 'images/168.jpg', 20, 'Node与express开发'),
(184, '计算机', 'images/169.jpg', 30, 'Jquery UI'),
(185, '计算机', 'images/170.jpg', 60, 'web前端开发技术实践指导教程'),
(186, '教材教辅', 'images/171.jpg', 19, '把你的英语用起来'),
(187, '教材教辅', 'images/172.jpg', 20, '最常用的英语3000单词一学就会'),
(188, '教材教辅', 'images/173.jpg', 40, '漂亮的英文句子，英语这样学就对了'),
(189, '教材教辅', 'images/174.jpg', 60, '商务英语10000个单词'),
(190, '教材教辅', 'images/175.jpg', 70, '每天读一点英语'),
(191, '教材教辅', 'images/176.jpg', 80, '365天英语口语大全'),
(192, '教材教辅', 'images/177.jpg', 57, '四级词汇'),
(193, '语言文学', 'images/178.jpg', 13, '终于等到你'),
(194, '语言文学', 'images/179.jpg', 28, '英语常用词 疑难用法手册'),
(195, '教材教辅', 'images/180.jpg', 32, '带着英语去旅行'),
(196, '教材教辅', 'images/181.jpg', 47, '商务英语职场王'),
(197, '教材教辅', 'images/182.jpg', 18, '学好英语这本书就够了'),
(198, '教材教辅', 'images/183.jpg', 2, '考研英语 语法新思维'),
(199, '教材教辅', 'images/184.jpg', 4, '金融英语'),
(200, '教材教辅', 'images/185.jpg', 6, '国际金融英语'),
(201, '教材教辅', 'images/186.jpg', 7, '英语语法新思维'),
(202, '教材教辅', 'images/187.jpg', 9, '商务英语函电'),
(203, '教材教辅', 'images/188.jpg', 11, '物流专业英语'),
(204, '教材教辅', 'images/189.jpg', 22, '机电专业英语'),
(205, '教材教辅', 'images/190.jpg', 18, '法律英语 阅读与翻译教程'),
(206, '教材教辅', 'images/191.jpg', 27, '会计英语'),
(207, '教材教辅', 'images/192.jpg', 20, '新编计算机专业英语'),
(208, '教材教辅', 'images/193.jpg', 7, '汽车英语'),
(209, '教材教辅', 'images/194.jpg', 33, '十二天突破英语语法'),
(210, '语言文学', 'images/195.jpg', 17, '痴人之爱'),
(211, '热门书籍', 'images/196.jpg', 3, '我不过低配的人生'),
(212, '热门书籍', 'images/197.jpg', 5, '我们都是孤独的行路人'),
(213, '热门书籍', 'images/198.jpg', 1, '我和你差之微毫的世界'),
(214, '语言文学', 'images/199.jpg', 6, '许你再相依'),
(215, '热门书籍', 'images/200.jpg', 9, '不期而遇的温暖'),
(216, '语言文学', 'images/201.jpg', 15, '巴尔扎克小说集');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`bookid`),
  ADD KEY `bookname` (`bookname`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `books`
--
ALTER TABLE `books`
  MODIFY `bookid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=217;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
